<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Dokumentation</TITLE>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.01Gold (Win16; I) [Netscape]">
</HEAD>
<BODY>

<CENTER><P><A NAME="top"></A><FONT FACE="Arial,Helvetica"><FONT SIZE=+3>Dokumentation</FONT></FONT>
<BR>
<FONT FACE="Arial,Helvetica">- erstes Kapitel -</FONT> </P></CENTER>

<P><BR>
</P>

<TABLE align=center>
<TR>
<TD>
<UL>
<LI><FONT FACE="Arial,Helvetica"><A HREF="doku2.htm#produktion">Produktionsverlauf</A></FONT></LI>

<UL>
<LI><FONT FACE="Arial,Helvetica"><A HREF="skript.htm">Ursprungsskript ohne
Verlinkung</A></FONT></LI>

<LI><FONT FACE="Arial,Helvetica"><A HREF="linkstruktur.htm">Linkstruktur
unter Frameber&uuml;cksichtigung</A></FONT></LI>

<LI><FONT FACE="Arial,Helvetica"><A HREF="linkstruktur2.htm">Linkstruktur
der Textdateien (Grafik)</A></FONT></LI>
</UL>

<LI><FONT FACE="Arial,Helvetica"><A HREF="dateien.htm">Vollst&auml;ndige
Liste aller Dateien</A></FONT></LI>

<LI><FONT FACE="Arial,Helvetica"><A HREF="doku2.htm#hilfsprogramme">Hilfsprogramme</A></FONT></LI>

<LI><FONT FACE="Arial,Helvetica"><A HREF="doku2.htm#quellen">Quellenverzeichnis</A></FONT></LI>

<LI><FONT FACE="Arial,Helvetica"><A HREF="doku2.htm#quellen">Danksagung</A></FONT></LI>
</UL>
</TD>
</TR>
</TABLE>
<br><br><br>
<P><A NAME="produktion"></A><B><FONT FACE="Arial,Helvetica">Produktionsverlauf</FONT></B>
<br>
<FONT FACE="Arial,Helvetica">Im Anschlu&szlig; an die Konzeption und einen
ersten Vorentwurf der Hyperfiktionskurzgeschichte durch das Projektteam
verfa&szlig;te ich das erste Kapitel als <A HREF="skript.htm">linearen
Text</A>. Da dieser Text im n&auml;chsten Arbeitsschritt auf etliche Dateien
verteilt werden sollte, mu&szlig;ten die verschiedenen kleinen Abs&auml;tze
inhaltlich so aufgebaut sein, da&szlig; sie sich zwar aufeinander beziehen,
jedoch m&ouml;glichst austauschbar sind. Die Schwierigkeit lag also darin,
die Textpassagen einerseits als inhaltlich abgeschlossene Einheiten zu
entwerfen, andererseits durften sie aber nicht f&uuml;r das Verst&auml;ndnis
des gesamten Kapitels von grundlegender Bedeutung sein. Die Verlinkung
in vier Frames als &auml;u&szlig;ere Form beeinflu&szlig;t somit gundlegend
Inhalt und Stil des Textes: der Protagonist der Hyperfiktionsgeschichte
darf zwar frei assoziieren, er ist aber in seiner Handlungsf&auml;higkeit&nbsp;
stark eingeschr&auml;nkt, wodurch das eigentliche Geschehen recht handlungsarm
wird.</FONT> </P>

<P><FONT FACE="Arial,Helvetica">Das Ursprungsskript wurde nach seiner Fertigstellung
auf einzelne HTML-Dateien verteilt, zwischen denen zun&auml;chst eine lineare
Verlinkung geschaffen wurde. Danach wurden zus&auml;tzliche Links eingef&uuml;gt,
die ein &Uuml;berspringen ganzer Teile des Textes erm&ouml;glichen oder
Textalternativen bieten. Da in Hinblick auf die Unterteilung in vier Frames
alle Links in &quot;Javascript&quot; programmiert werden mu&szlig;ten,
wurde die Verlinkung manuell mit einem herk&ouml;mmlichen Texteditor durchgef&uuml;hrt.
Die &uuml;blichen Programme zur Erstellung von HTML-Dateien bieten n&auml;mlich
keine M&ouml;glichkeit, gleichzeitig mehrere Frameinhalte mit einem Link
zu ver&auml;ndern.</FONT> </P>

<P><FONT FACE="Arial,Helvetica">Die nun vorliegende Linkstruktur konnte
anschlie&szlig;end auf die vier Frames verteilt werden, was mittels einer
<A HREF="linkstruktur.htm">Tabelle</A> geschah, in der zu jedem Link verzeichnet
wurde, welche neuen Frameinhalte sich bei seiner Bet&auml;tigung &ouml;ffnen.
Das erste Resultat meiner Projektarbeit ver&ouml;ffentlichte ich im WWW,
um es den anderen Mitgliedern des Projektteams zur Sichtung und &Uuml;berpr&uuml;fung
vorzustellen. Diese Kontrolle deckte noch einige Fehler auf, die daraufhin
behoben werden konnten.</FONT> </P>

<P><FONT FACE="Arial,Helvetica">Jetzt konnte ich damit beginnen, das Kapitel
weiter auszuarbeiten, indem ich zum Text passende Bilder und weitere Textstellen
sammelte, die die Assoziationen des Protagonisten veranschaulichen sollten.
Zu jedem Bild wurde eine HTML-Datei erstellt, die das jeweilige Bild in
ein 400 mal 300 Pixel gro&szlig;es Frame einpa&szlig;t. Danach wurden diese
HTML-Dateien - mit Hilfe der <A HREF="linkstruktur.htm">Tabelle</A> -
als Links in diejenigen Dateien, in denen sich der fiktionale Text befindet,
eingebaut.</FONT> </P>

<P><FONT FACE="Arial,Helvetica">In einer der n&auml;chsten Projektsitzungen
wurde angeregt, die bereits rezipierten Textstellen so zu entwerfen, da&szlig;
es f&uuml;r den Leser unm&ouml;glich ist, noch nachtr&auml;glich einen
anderen Weg der Geschichte einzuschlagen. Daf&uuml;r mu&szlig;te die Geschichte
in einem Rahmen er&ouml;ffnet werden, der - im Gegensatz zum normalen Browser-Fenster
- keine R&uuml;cksprungm&ouml;glichkeit bietet. Damit die Textdateien auch
ohne Verlinkung in der Geschichte auftauchen, nutzte ich ein Backup der
urspr&uuml;nglichen Textdateien ohne Verlinkung und f&uuml;gte diese zus&auml;tzlich
in die Tabelle und in die Verlinkung ein. Es folgte eine &Uuml;berarbeitung
der Verlinkung.</FONT> </P>

<P><FONT FACE="Arial,Helvetica">Nach einer <A HREF="linkstruktur2.htm">grafischen
Darstellung der Linkstruktur</A> zeigte sich, da&szlig; einige Abschnitte
des Kapitels noch zu linear verlinkt waren und deshalb noch zu viele Textstellen
vorkamen, die nicht umgangen werden konnten. Mit Hilfe des Textmanuskripts
und der Grafik der Linkstruktur lie&szlig;en sich noch einige Links hinzuf&uuml;gen,
so da&szlig; weitere Textstellen umgehbar wurden. Durch diese Vorgehensweise
wurde die Linearit&auml;t des Textes stellenweise aufgehoben. Schlie&szlig;lich
wurden noch einige Assoziationen des Protagonisten hinzugef&uuml;gt, die
Verlinkung &uuml;berarbeitet und einige Textstellen abge&auml;ndert oder
ersetzt.</FONT> <BR>
&nbsp; </P>

<P><A NAME="hilfsprogramme"></A><B><FONT FACE="Arial,Helvetica">Hilfsprogramme*</FONT></B>
<BR>
<FONT FACE="Arial,Helvetica">Das erste Kapitel von &quot;Fear Frames&quot;
wurde mit folgenden Programmen erstellt und bearbeitet:</FONT> </P>

<UL>
<LI><FONT FACE="Arial,Helvetica">Paint Shop Pro 2.0</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Paint Shop Pro 3.11</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Micrografx Gif Construction Set</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Netscape Composer 4.51</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Netscape Gold Editor 3.01</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Microsoft Editor</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Photo Shop 4.0</FONT></LI>
</UL>

<P><FONT FACE="Arial,Helvetica">Zus&auml;tzlich zur Erstellung der Dokumentation
dienten:</FONT> </P>

<UL>
<LI><FONT FACE="Arial,Helvetica">Microsoft Powerpoint 97 SR-1</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Microsoft Word 97 SR-1</FONT></LI>
</UL>

<P><BR>
<A NAME="quellen"></A><B><FONT FACE="Arial,Helvetica">Quellenverzeichnis</FONT></B>
<BR>
<FONT FACE="Arial,Helvetica">In der Hyperfiktionsgeschichte wurden Zitate
aus verschiedenen Texten verwandt. Die Quellen sind in den entsprechenden
HTML-Dateien als Metatags verzeichnet. Zum &Uuml;berblick hier die wichtigsten
bibliographischen Angaben:</FONT> </P>

<ul>
<li><FONT FACE="Arial,Helvetica">Appleby, Steven: <i>Die Memoiren von Captain
J. Star</i>. Kiel 1994.</FONT> </li>

<li><FONT FACE="Arial,Helvetica"><i>Duden</i>. Rechtschreibung der deutschen Sprache.
Hg. von G&uuml;nther Drosdowski. Mannheim 1996.</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Goethe, Johann Wolfgang von: <i>Der Zauberlehrling</i>.
In: Deutsche Gedichte. Auswahl f&uuml;r Schulen. Hg. von Echtermeyer/ von
Wiese. D&uuml;sseldorf 1981. S. 213f.</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Heym, Georg: <i>Der Krieg</i>. In: Deutsche Gedichte.
Auswahl f&uuml;r Schulen. Hg. von Echtermeyer/ von Wiese. D&uuml;sseldorf
1981. S. 609.</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Homes, Sven: <i>Neue Welt</i>. In: 4in1. Der Kulturmarathon
pr&auml;sentiert. Herne 1996 (=NRW110).</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Kafka, Franz: <i>Gib's auf!</i> In: Ders.: Gesammelte
Werke. Hg. von Max Brod. New York 1946. S. 117.</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Musil, Robert: <i>Der Mann ohne Eigenschaften</i>.
In: Ders.: Gesammelte Werke. Hg. von Adolf Fris&eacute;. Reinbek 1978.
S. 37.</FONT></li>

<li><FONT FACE="Arial,Helvetica">Kunert, G&uuml;nter: <i>Wie ich ein Fisch wurde</i>.
In: Deutsche Gedichte. Auswahl f&uuml;r Schulen. Hg. von Echtermeyer/ von
Wiese. D&uuml;sseldorf 1981. S. 700-701.</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Schulz, Charles: <i>Bleib am Ball, Charlie Braun!</i>
G&ouml;tzenhain 1972.</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Schulz, Charles: <i>Frohe Ferien, Charlie Braun!</i>
G&ouml;tzenhain 1972.</FONT> </li>

<li><FONT FACE="Arial,Helvetica">Spilker, Frank: <i>Universal Tellerw&auml;scher</i>.
In: In Echt. Hamburg 1995.</FONT> </li>
</ul>

<br>
<P><A NAME="dank"></A><B><FONT FACE="Arial,Helvetica">Danksagung</FONT></B>
<BR>
<FONT FACE="Arial,Helvetica">Mein Dank geht in erster Linie an die Testleser
der Geschichte, aber auch an:</FONT> </P>

<UL>
<LI><FONT FACE="Arial,Helvetica">JASC Software f&uuml;r Bereitstellung
von Sharewareversionen ihrer Grafikprogramme &quot;Paint Shop Pro&quot;</FONT></LI>

<LI><FONT FACE="Arial,Helvetica">Micrografx f&uuml;r die Sharewareversion
von&nbsp;</FONT><IMG SRC="gif.gif" HEIGHT=38 WIDTH=179 ALIGN=CENTER></LI>

<LI><FONT FACE="Arial,Helvetica">Das Universit&auml;tsrechenzentrum Trier
f&uuml;r die Bereitstellung von genug Plattenplatz, Scannern und Software</FONT></LI>
</UL><br><br><br>

<center><form><input type="button" value="zurück zur Haupseite" 
  onClick="parent.location='../../inhalt2.htm#kapitel';"></form></center>

<CENTER><P><BR><br><br>
<FONT FACE="Arial,Helvetica"><FONT SIZE=-2>*(Die Namen &quot;Microsoft&quot;,
&quot;Powerpoint&quot;, &quot;Paint Shop&quot;, &quot;Micrografx&quot;,
&quot;Netscape&quot; sind als eingetragene Warenzeichen urheberrechtlich
gesch&uuml;tzt)</FONT></FONT> </P></CENTER>

</BODY>
</HTML>
