<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.51 [de]C-CCK-MCD QXW03200  (Win95; I) [Netscape]">
   <title>Skizzenpapier</title>
</head>
<body text="#FFFFFF" bgcolor="#000000" link="#C0C0C0" vlink="#FFFFFF" alink="#828282">

<center><font face="Arial,Helvetica"><font size=+3>Das Ursprungsskript</font></font>
<br><font face="Arial,Helvetica">- erstes Kapitel -</font></center>

<br><font face="Arial,Helvetica"></font>&nbsp;
<p><br>
<p>ich bin wach, ich bin wach! Ruhe! Blo&szlig; den Wecker ausmachen.
<p>Alles, was du wei&szlig;t ist, wenn du aufwachst, wirst du darum betteln,
wieder zu tr&auml;umen.
<p>// Frank Spilker, CD: Die Sterne: Posen; Track 4: Zucker
<p>Wo ist denn der bl&ouml;de Knopf? Na endlich. Mann. Nicht schon wieder.
Warum immer ich?
<p>in meinem Blut str&ouml;mt der ozean. wilde wasser sp&uuml;len die gef&uuml;hlr
in jedes organ. aus meinen augen flie&szlig;t der regen bew&auml;ssert
meinen boden macht mich frei f&uuml;r neues leben. jeder neue tag ist ein
neues leben, das so schnell vergeht und doch immer wiederkehrt ich hab
die ganze welt in mir zu erleben sie ist ein teil von mir und ich bin ein
teil von ihr. in meinem herzern, soll die sonne scheinen, erleuchjten meine
fragen erhelln die schattenseiten. in meiner lunge weht der wind der ewigkeit.
was ist schon zeit wenn du begreifst in jedem augenblick steckt freiheit.
jeder atemzug ist ein ganzes leben das so schnell vergeht und doch immer
wiederkehrt ich hab die ganze welt in mir zu erleben sie ist ein teil von
mir und ich bin ein teil von ihr.
<p>// Aus: sven homes: Art explosion: CD: NRW 110: neue Welt
<p>Nur noch ein St&uuml;ndchen schlafen...
<p>Ich k&ouml;nnte heute mal krankfeiern. Am besten gleich die ganze Woche.
Aber das w&uuml;rde mir ja eh keiner glauben. Gestern war ich ja noch kerngesund.
Ich k&ouml;nnte ab morgen krankfeiern, wenn ich heute schon ein bisschen
eine Grippe vort&auml;usche.
<p>Heute mu&szlig; ich auf jeden Fall zur Arbeit. Liegt ja noch genug von
gestern auf meinem Tisch.
<p>Er hat immer Hunger / er mu&szlig; immer essen /Er mu&szlig; wohnen
und schlafen / und vergessen / das Gestern wie Heute wird / Heute wie Morgen
/ und das in diesem Laden herzlich wenigpassiert / er dr&auml;ngelt sich
in Bahnen und schubst sich aus dem Haus / in die Gegend wo man ihn erwartet
/ und verbraucht / er kennt sich schon lange und kann sich nicht mehr sehen
/ dabei gibt es wirklich tausend sch&ouml;ne Filme &uuml;ber ihn / als
den Universal Tellerw&auml;scher / in den Studios / Er w&auml;scht wirklich
Teller / er tut nicht so / Ich hatte Haben / Ich hatte Geld gespart / Ich
lief durch die Phasen / war im Apparat / In diesem und jenem / um nicht
alle zu nennen / Ich lief auf der Stelle und / fing an zu rennen / nichts
hat geholfen / wieder alles verspielt / die Tage sehen gleich aus / es
sind zuviel / Jeder Tag ist ein Verfahren gegen mich / Ich wei&szlig; nicht
warum und wer / sich was davon verspricht / Ich m&ouml;chte einen Anwalt
/ Ich will Geld / und ich m&ouml;chte Gottverdammtnochmal das jemand sein
Versprechen h&auml;lt / Universal Tellerw&auml;scher...
<p>// Frank Spilker; CD:Die Sterne: Unter Geiern: Universal Tellerw&auml;scher
<p>Also mit einem Ruck raus aus dem Bett.
<p>Das war definitiv zu schnell. Der Kreislauf ist noch nicht da. Wenn
das Schwindelgef&uuml;hl verschwindet, kann ich aufstehen.
<p>Ich bin ganz klar ein Morgenmuffel. Aber wie kann man blo&szlig; kurz
nach dem Aufstehen schon topfit sein? Wenn ich erst mal geduscht habe und
meine erste Tasse Kaffee getrunken, wird 's schon irgendwie wieder geh'n.
<p>ich bin ein ganz normaler tag, ich bin so wie ein leeres blatt / und
nichts hat sich erledigt / alles liegt genau so da, wie es gestern abend
war / einem tr&uuml;mmerhaufen &auml;hnlich / es betrifft mich keine schuld,
ich bin genausoviel geduld, / wie wenig. / ich bin erbarmungslose uhr,
ich geh nicht nach, noch geh ich vor, / sag jetzt blo&szlig; nichts ich
versteh nichts. / du fragst dich: / war die hoffnung blind, die nur den
morgen, nicht das grauen sah? / mein liebes kind, / ich bin die b&uuml;hne
nur und nicht das drama, / ich bin nicht wirklich die gefahr.
<p>// Frank Spilker: CD:Die Sterne: Von allen Gedanken sch&auml;tze ich
doch am meisten die Interessanten: ganz normaler Tag.
<p>Erstmal die Kaffeemaschine anstellen.
<p>Den Filter von gestern rausholen, die Kaffeekanne umsp&uuml;len und
bis zum Strich mit der vier mit Wasser f&uuml;llen. In die Maschine gie&szlig;en.
Neue Filter stehen im Regal bei der T&uuml;tensuppe.
<p>Mist. Immer, wenn ich einen Filter aus der Schachtel ziehe, f&auml;llt
ein zweiter auf den Boden. Jedes mal.Das ist aber auch mal wieder typisch,
da&szlig; mir das gleiche Mi&szlig;geschick immer wieder passiert. Ich
hab weder Nerven noch Zeit, den &uuml;berfl&uuml;ssigen Filter wieder zur&uuml;ck
in die Schachtel zu friemeln. Also klemme ich ihn im regal zwischen T&uuml;tensuppen
und K&uuml;chenrolle. Wenn ich mir das n&auml;chste mal eine Suppe koche,
zieh ich den dann wieder mit raus und er landet erneut auf dem Boden. Ist
das Pessimismus, wenn man so etwas denkt?
<p>Den anderen Filter in die Maschine spannen, m&ouml;glichst so, da&szlig;
er nicht nach innen umklappt.
<p>Die Kaffeedose steht auch im regal.
<p>Der d&uuml;nne Plastikdeckel h&auml;lt den Kaffee bestimmt nicht sehr
aromatisch, ist aber leicht zu &ouml;ffnen.
<p>Zwei geh&auml;ufte Teel&ouml;ffel in den Filter der Kaffeemaschine.
Die Kaffeedose ist schon wieder fast leer.
<p>Mein Kaffeekonsum hat in der letzten Zeit auch wirklich ein wenig zugenommen.
<p>Das ist wohl, weil ich mich immer so m&uuml;de f&uuml;hle.
<p>Noch einen L&ouml;ffel mehr, f&uuml;r den Geschmack und wegen dem Koffein.
<p>Maschine zugeklappt und angeschaltet. Jetzt ins Badezimmer.
<p>Die erste &Uuml;berraschung des Tages vor dem Spiegel.
<p>Ich seh gar nicht so schei&szlig;e aus, wie ich mich f&uuml;hle.
<p>R&auml;nder unter den Augen g&auml;hne ich mich selber an. Ich mu&szlig;
noch ein wenig wacher werden, sonst halte ich nicht einmal die ersten zwei
Stunden dieses Tages aus. Also unter die Dusche.
<p>Ich h&auml;tte so gerne lauwarmes Wasser, das eher zum Kalten hin tendiert,
aber es gibt nur zwei Temperaturen bei dieser Dusche: zu kalt und zu warm.
<p>Ich drehe an den Armaturen rum. manchmal wird es wieder ertr&auml;glicher.
<p>Ein Lied kommt mir in den Sinn.
<p>singing in the rain. i'm singing in the rain. just singing in the rain.
what a wonderful feeling, i'm happy again.
<p>Jetzt, nach den Wiederbelebungsversuchen f&uuml;r meinen Kreislauf,
erstmal Shampoo in die Haare, einmassieren und auswaschen. Duschgel auf
den Rest des K&ouml;rpers. Wieder abwaschen.
<p>Noch etwas unter dem Wasserstrahl stehenbleiben.
<p>I'm singing, I'm singing in the rain.
<p>Leben hei&szlig;t: Sich ohne Ende wandeln. Wer am alten h&auml;ngt,
der wird nicht alt. So entschlo&szlig; ich mich, sofort zu handeln, Und
das Wasser schien mir nicht mehr kalt. Meine Arme dehnten sich zu breiten
Flossen, Gr&uuml;ne Schuppen wuchsen auf mir ohne Hast; Als das Wasser
mir auch noch den Mund verschlossen, War dem neuen Element ich angepa&szlig;t.
Lasse mich durch dunkle Tiefen tr&auml;ge gleiten, Und ich sp&uuml;re nichts
von Wellen oder Wind, Aber ich f&uuml;rchte jetzt die Trockenheiten, Und
das einst das Wasser wiederum verrinnt.
<p>// Aus: Gunter Kunert : Wie ich ein Fisch wurde
<p>Jetzt ne Tasse Kaffee, das w&auml;r klasse.
<p>So, als ob der Kaffee nicht auf mich warten w&uuml;rde stell ich das
Wasser ab und zieh den Duschvorhang beiseite. Das Handtuch h&auml;ngt am
Heizk&ouml;rper.
<p>Aber gerade nah genug, da&szlig; man nicht aus der dusche heraustreten
mu&szlig;, um es mit der Hand zu erreichen.
<p>Schnell abtrocknen und aus der Dusche raus. Die nassen Haare tropfen
noch auf den Boden.
<p>Die werden auch abgetrocknet.
<p>In der K&uuml;che f&auml;ngt die Kaffeemaschine schon an, das letzte
Wasser in sich hineinzuschl&uuml;rfen und dampfend auf das Kaffeepulver
zu gie&szlig;en.
<p>Hoffentlich ist der Filter nicht umgeknickt.
<p>Der Badezimmerspiegel ist beschlagen.
<p>Ich wische ein Sichtloch frei und gehe einmal kurz mit dem Kamm durch
die noch nassen Haare und danach sofort in die K&uuml;che.
<p>Ich hab' Gl&uuml;ck, offensichtlich ist der Kaffeefilter nicht umgeknickt.
<p>Eigentlich k&ouml;nnte man sich jetzt so ein richtiges Klischeefr&uuml;hst&uuml;ck
zaubern.
<p>Br&ouml;tchen vom B&auml;cker holen, ein Ei kochen...
<p>Auf ein Ei hab ich schon gar keinen Hunger.
<p>Der B&auml;cker hat noch zu. Der macht erst um achtuhrdrei&szlig;ig
auf.
<p>Also besser zwei Scheiben Brot toasten, Marmelade drauf und fertig.
<p>Die Blumen aum Fenster sehen auch aus, als wollten sie mal wieder Wasser
haben.
<p>Mit dem Gedanken, da&szlig; die K&uuml;che ein wenig Gr&uuml;n vertragen
k&ouml;nnte, hab ich die damals bei Plus gekauft.
<p>Ich hab gar keine Gie&szlig;kanne. Dann gie&szlig; ich die Blumen gleich
mit der Kaffeekanne, wenn die leer ist. Improvisation ist alles.
<p>Inzwischen ist auch der Toast fertig. Eigentlich die Toaste. Oder die
Toasts? Was ist denn der Plural von Toast? Egal, die beiden Toastbrotscheiben
sind fertig und werden kalt, wenn ich &uuml;ber sie nachdenke, statt sie
zu essen.
<br><br>
<center>
<FORM><INPUT type="button" value="zurück zur Dokumentation" 
  onClick="parent.location='doku2.htm#top';"></FORM>
</center>
</body>
</html>
